In [6]:
import pandas as pd
import os
import glob

In [4]:
os.chdir('C:\\Users\\oryza\\OneDrive\\Desktop\\DataScience\\Web_Scrap_from_youtube\\virtual_env\\demo_CPO_production\\WQD7005_DataMining\\A_Raw_Data\\CPOMalaysiaProductionByMonth')

In [5]:
os.getcwd()

'C:\\Users\\oryza\\OneDrive\\Desktop\\DataScience\\Web_Scrap_from_youtube\\virtual_env\\demo_CPO_production\\WQD7005_DataMining\\A_Raw_Data\\CPOMalaysiaProductionByMonth'

In [9]:
path=r'C:\Users\oryza\OneDrive\Desktop\DataScience\Web_Scrap_from_youtube\virtual_env\demo_CPO_production\WQD7005_DataMining\A_Raw_Data\CPOMalaysiaProductionByMonth'
all_files = glob.glob(path + "/*.json")

In [12]:
all_files[0:]

['C:\\Users\\oryza\\OneDrive\\Desktop\\DataScience\\Web_Scrap_from_youtube\\virtual_env\\demo_CPO_production\\WQD7005_DataMining\\A_Raw_Data\\CPOMalaysiaProductionByMonth\\CPOProduction2013.json',
 'C:\\Users\\oryza\\OneDrive\\Desktop\\DataScience\\Web_Scrap_from_youtube\\virtual_env\\demo_CPO_production\\WQD7005_DataMining\\A_Raw_Data\\CPOMalaysiaProductionByMonth\\CPO_Production2014.json',
 'C:\\Users\\oryza\\OneDrive\\Desktop\\DataScience\\Web_Scrap_from_youtube\\virtual_env\\demo_CPO_production\\WQD7005_DataMining\\A_Raw_Data\\CPOMalaysiaProductionByMonth\\CPO_Production2015.json',
 'C:\\Users\\oryza\\OneDrive\\Desktop\\DataScience\\Web_Scrap_from_youtube\\virtual_env\\demo_CPO_production\\WQD7005_DataMining\\A_Raw_Data\\CPOMalaysiaProductionByMonth\\CPO_Production2016.json',
 'C:\\Users\\oryza\\OneDrive\\Desktop\\DataScience\\Web_Scrap_from_youtube\\virtual_env\\demo_CPO_production\\WQD7005_DataMining\\A_Raw_Data\\CPOMalaysiaProductionByMonth\\CPO_Production2017.json',
 'C:\\Users\\oryza\\OneDrive\\Desktop\\DataScience\\Web_Scrap_from_youtube\\virtual_env\\demo_CPO_production\\WQD7005_DataMining\\A_Raw_Data\\CPOMalaysiaProductionByMonth\\CPO_Production2018.json',
 'C:\\Users\\oryza\\OneDrive\\Desktop\\DataScience\\Web_Scrap_from_youtube\\virtual_env\\demo_CPO_production\\WQD7005_DataMining\\A_Raw_Data\\CPOMalaysiaProductionByMonth\\CPO_Production2019.json']

In [25]:
File_2013=all_files[0]
File_2014=all_files[1]
File_2015=all_files[2]
File_2016=all_files[3]
File_2017=all_files[4]
File_2018=all_files[5]
File_2019=all_files[6]

In [26]:
File_2013_json=pd.read_json(File_2013)
File_2014_json=pd.read_json(File_2014)
File_2015_json=pd.read_json(File_2015)
File_2016_json=pd.read_json(File_2016)
File_2017_json=pd.read_json(File_2017)
File_2018_json=pd.read_json(File_2018)
File_2019_json=pd.read_json(File_2019)

In [27]:
print(File_2013_json)
print(File_2014_json)
print(File_2015_json)
print(File_2016_json)
print(File_2017_json)
print(File_2018_json)
print(File_2019_json)

      Year  Month   Production
0      NaN    NaN          NaN
1   2013.0    NaN          NaN
2      NaN  [Jan]  [1,288,294]
3      NaN  [Feb]  [1,188,356]
4      NaN  [Mar]  [1,211,257]
5      NaN  [Apr]  [1,272,622]
6      NaN  [May]  [1,383,735]
7      NaN  [Jun]  [1,470,648]
8      NaN  [Jul]  [1,691,916]
9      NaN  [Aug]  [1,664,249]
10     NaN  [Sep]  [2,004,238]
11     NaN  [Oct]  [1,938,430]
12     NaN  [Nov]  [1,891,132]
13     NaN  [Dec]  [1,780,262]
14     NaN    NaN          NaN
      Year  Month   Production
0      NaN    NaN          NaN
1   2014.0    NaN          NaN
2      NaN  [Jan]  [1,508,980]
3      NaN  [Feb]  [1,277,999]
4      NaN  [Mar]  [1,497,145]
5      NaN  [Apr]  [1,555,777]
6      NaN  [May]  [1,656,970]
7      NaN  [Jun]  [1,569,788]
8      NaN  [Jul]  [1,665,612]
9      NaN  [Aug]  [2,031,754]
10     NaN  [Sep]  [1,896,899]
11     NaN  [Oct]  [1,892,996]
12     NaN  [Nov]  [1,750,567]
13     NaN  [Dec]  [1,364,797]
14     NaN    NaN          NaN
     Month    Year   Production
0      [ ]     NaN          NaN
1      [ ]  2015.0          NaN
2    [Jan]     NaN  [1,160,687]
3    [Feb]     NaN  [1,121,628]
4    [Mar]     NaN  [1,495,151]
5    [Apr]     NaN  [1,693,425]
6    [May]     NaN  [1,810,530]
7   [June]     NaN  [1,763,667]
8    [Jul]     NaN  [1,815,634]
9    [Aug]     NaN  [2,051,000]
10   [Sep]     NaN  [1,959,064]
11   [Oct]     NaN  [2,037,466]
12   [Nov]     NaN  [1,653,946]
13   [Dec]     NaN  [1,399,383]
14     NaN     NaN          NaN
          Year       Month   Production
0   Production         NaN          NaN
1         2016         NaN          NaN
2          NaN       [Jan]  [1,129,747]
3          NaN       [Feb]  [1,042,904]
4          NaN       [Mar]  [1,219,449]
5          NaN       [Apr]  [1,301,291]
6          NaN       [May]  [1,364,583]
7          NaN      [June]  [1,532,613]
8          NaN       [Jul]  [1,585,341]
9          NaN       [Aug]  [1,701,833]
10         NaN       [Sep]  [1,715,085]
11         NaN       [Oct]  [1,677,873]
12         NaN       [Nov]  [1,574,938]
13         NaN       [Dec]  [1,473,717]
14         NaN  [*Jan-Dec]  [1,443,281]
          Year       Month   Production
0   Production         NaN          NaN
1         2017         NaN          NaN
2          NaN       [Jan]  [1,276,849]
3          NaN       [Feb]  [1,258,539]
4          NaN       [Mar]  [1,464,021]
5          NaN       [Apr]  [1,548,026]
6          NaN       [May]  [1,654,494]
7          NaN      [June]  [1,514,165]
8          NaN       [Jul]  [1,826,828]
9          NaN       [Aug]  [1,810,551]
10         NaN       [Sep]  [1,779,918]
11         NaN       [Oct]  [2,008,838]
12         NaN       [Nov]  [1,942,847]
13         NaN       [Dec]  [1,834,167]
14         NaN  [*Jan-Dec]  [1,659,937]
          Year       Month   Production
0   Production         NaN          NaN
1         2018         NaN          NaN
2          NaN       [Jan]  [1,586,653]
3          NaN       [Feb]  [1,342,805]
4          NaN       [Mar]  [1,573,957]
5          NaN       [Apr]  [1,558,331]
6          NaN       [May]  [1,525,405]
7          NaN      [June]  [1,332,704]
8          NaN       [Jul]  [1,503,220]
9          NaN       [Aug]  [1,620,605]
10         NaN       [Sep]  [1,853,602]
11         NaN       [Oct]  [1,964,954]
12         NaN       [Nov]  [1,845,222]
13         NaN       [Dec]  [1,808,038]
14         NaN  [*Jan-Dec]  [1,626,291]
      Year   Month   Production
0      NaN     NaN          NaN
1   2019.0     NaN          NaN
2      NaN   [Jan]  [1,737,461]
3      NaN   [Feb]  [1,544,518]
4      NaN   [Mar]  [1,672,058]
5      NaN   [Apr]  [1,649,368]
6      NaN   [May]  [1,671,467]
7      NaN  [June]  [1,510,957]
8      NaN   [Jul]  [1,740,759]
9      NaN   [Aug]  [1,821,548]
10     NaN   [Sep]  [1,842,433]
11     NaN   [Oct]  [1,795,841]
12     NaN   [Nov]  [1,538,053]
13     NaN   [Dec]  [1,333,904]
14     NaN     NaN          NaN

In [29]:
File_2013_json_Update=File_2013_json.drop(['Year'], axis=1)
File_2014_json_Update=File_2014_json.drop(['Year'], axis=1)
File_2015_json_Update=File_2015_json.drop(['Year'], axis=1)
File_2016_json_Update=File_2016_json.drop(['Year'], axis=1)
File_2017_json_Update=File_2017_json.drop(['Year'], axis=1)
File_2018_json_Update=File_2018_json.drop(['Year'], axis=1)
File_2019_json_Update=File_2019_json.drop(['Year'], axis=1)

In [31]:
File_2013_json_Update.isna().sum()

Month         3
Production    3
dtype: int64

In [32]:
File_2014_json_Update.isna().sum()

Month         3
Production    3
dtype: int64

In [33]:
File_2015_json_Update.isna().sum()

Month         1
Production    3
dtype: int64

In [34]:
File_2016_json_Update.isna().sum()

Month         2
Production    2
dtype: int64

In [35]:
File_2017_json_Update.isna().sum()

Month         2
Production    2
dtype: int64

In [36]:
File_2018_json_Update.isna().sum()

Month         2
Production    2
dtype: int64

In [37]:
File_2019_json_Update.isna().sum()

Month         3
Production    3
dtype: int64

In [38]:
File_2013_json_Update.dropna(inplace=True)
File_2014_json_Update.dropna(inplace=True)
File_2015_json_Update.dropna(inplace=True)
File_2016_json_Update.dropna(inplace=True)
File_2017_json_Update.dropna(inplace=True)
File_2018_json_Update.dropna(inplace=True)
File_2019_json_Update.dropna(inplace=True)

In [22]:
File_2013_json_Update

    Month   Production
2   [Jan]  [1,288,294]
3   [Feb]  [1,188,356]
4   [Mar]  [1,211,257]
5   [Apr]  [1,272,622]
6   [May]  [1,383,735]
7   [Jun]  [1,470,648]
8   [Jul]  [1,691,916]
9   [Aug]  [1,664,249]
10  [Sep]  [2,004,238]
11  [Oct]  [1,938,430]
12  [Nov]  [1,891,132]
13  [Dec]  [1,780,262]

In [39]:
File_2014_json_Update

    Month   Production
2   [Jan]  [1,508,980]
3   [Feb]  [1,277,999]
4   [Mar]  [1,497,145]
5   [Apr]  [1,555,777]
6   [May]  [1,656,970]
7   [Jun]  [1,569,788]
8   [Jul]  [1,665,612]
9   [Aug]  [2,031,754]
10  [Sep]  [1,896,899]
11  [Oct]  [1,892,996]
12  [Nov]  [1,750,567]
13  [Dec]  [1,364,797]

In [40]:
File_2015_json_Update

     Month   Production
2    [Jan]  [1,160,687]
3    [Feb]  [1,121,628]
4    [Mar]  [1,495,151]
5    [Apr]  [1,693,425]
6    [May]  [1,810,530]
7   [June]  [1,763,667]
8    [Jul]  [1,815,634]
9    [Aug]  [2,051,000]
10   [Sep]  [1,959,064]
11   [Oct]  [2,037,466]
12   [Nov]  [1,653,946]
13   [Dec]  [1,399,383]

In [52]:
File_2016_json_Update.drop(File_2016_json_Update.index[12])

     Month   Production
2    [Jan]  [1,129,747]
3    [Feb]  [1,042,904]
4    [Mar]  [1,219,449]
5    [Apr]  [1,301,291]
6    [May]  [1,364,583]
7   [June]  [1,532,613]
8    [Jul]  [1,585,341]
9    [Aug]  [1,701,833]
10   [Sep]  [1,715,085]
11   [Oct]  [1,677,873]
12   [Nov]  [1,574,938]
13   [Dec]  [1,473,717]

In [54]:
File_2017_json_Update.drop(File_2017_json_Update.index[12])

     Month   Production
2    [Jan]  [1,276,849]
3    [Feb]  [1,258,539]
4    [Mar]  [1,464,021]
5    [Apr]  [1,548,026]
6    [May]  [1,654,494]
7   [June]  [1,514,165]
8    [Jul]  [1,826,828]
9    [Aug]  [1,810,551]
10   [Sep]  [1,779,918]
11   [Oct]  [2,008,838]
12   [Nov]  [1,942,847]
13   [Dec]  [1,834,167]

In [55]:
File_2018_json_Update.drop(File_2018_json_Update.index[12])

     Month   Production
2    [Jan]  [1,586,653]
3    [Feb]  [1,342,805]
4    [Mar]  [1,573,957]
5    [Apr]  [1,558,331]
6    [May]  [1,525,405]
7   [June]  [1,332,704]
8    [Jul]  [1,503,220]
9    [Aug]  [1,620,605]
10   [Sep]  [1,853,602]
11   [Oct]  [1,964,954]
12   [Nov]  [1,845,222]
13   [Dec]  [1,808,038]

In [44]:
File_2019_json_Update

     Month   Production
2    [Jan]  [1,737,461]
3    [Feb]  [1,544,518]
4    [Mar]  [1,672,058]
5    [Apr]  [1,649,368]
6    [May]  [1,671,467]
7   [June]  [1,510,957]
8    [Jul]  [1,740,759]
9    [Aug]  [1,821,548]
10   [Sep]  [1,842,433]
11   [Oct]  [1,795,841]
12   [Nov]  [1,538,053]
13   [Dec]  [1,333,904]